<a href="https://colab.research.google.com/github/Denilza/SQLCommands/blob/main/Exercicios_Banco_de_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

In [ ]:
conn = sqlite3.connect(':memory:')  # Banco de dados em memória (temporário)
cursor = conn.cursor()

1. Crie uma tabela chamada "alunos" com os seguintes campos: id
(inteiro), nome (texto), idade (inteiro) e curso (texto).

In [ ]:
cursor.execute('''
CREATE TABLE alunos (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    curso TEXT
)
''')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no
exercício anterior.

In [ ]:
alunos_dados = [
    (1, 'Elisa', 22, 'Medicina'),
    (2, 'Carlos', 25, 'Direito'),
    (3, 'Brenda', 45, 'Medicina'),
    (4, 'Daniel', 21, 'Letras'),
    (5, 'Isa', 36, 'Música'),
    (6, 'Pedro', 20, 'Engenharia'),
    (7, 'Rick', 31, 'Engenharia')
]

In [ ]:
cursor.executemany('INSERT INTO alunos VALUES (?, ?, ?, ?)', alunos_dados)
conn.commit()

3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:
a) Selecionar todos os registros da tabela "alunos".

In [ ]:
cursor.execute('SELECT * FROM alunos')
todos_alunos = cursor.fetchall()

In [ ]:
print("Todos os alunos:", todos_alunos)

Todos os alunos: [(1, 'Elisa', 22, 'Medicina'), (2, 'Carlos', 25, 'Direito'), (3, 'Brenda', 45, 'Medicina'), (4, 'Daniel', 21, 'Letras'), (5, 'Isa', 36, 'Música'), (6, 'Pedro', 20, 'Engenharia'), (7, 'Rick', 31, 'Engenharia')]

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
alunos_maiores_20 = cursor.fetchall()

In [ ]:
print("Alunos com mais de 20 anos:", alunos_maiores_20)

Alunos com mais de 20 anos: [('Elisa', 22), ('Carlos', 25), ('Brenda', 45), ('Daniel', 21), ('Isa', 36), ('Rick', 31)]

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

In [ ]:
cursor.execute('SELECT nome FROM alunos WHERE curso = "Engenharia" ORDER BY nome')
alunos_engenharia = cursor.fetchall()

In [ ]:
print("Alunos de Engenharia em ordem alfabética:", alunos_engenharia)

Alunos de Engenharia em ordem alfabética: [('Pedro',), ('Rick',)]

d) Contar o número total de alunos na tabela

In [ ]:
cursor.execute('SELECT COUNT(*) FROM alunos')
total_alunos = cursor.fetchone()[0]

In [ ]:
print("Número total de alunos:", total_alunos)

Número total de alunos: 7

4. Atualização e Remoção

In [ ]:
#a) Atualize a idade de um aluno específico na tabela.

In [ ]:
cursor.execute('UPDATE alunos SET idade = 32 WHERE nome = "Elisa"')
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM alunos WHERE nome = "Elisa"')
aluno_atualizado = cursor.fetchone()

In [ ]:
print("Aluno atualizado:", aluno_atualizado)

Aluno atualizado: (1, 'Elisa', 32, 'Medicina')

In [ ]:
#b)Remova um aluno pelo seu ID.
cursor.execute('DELETE FROM alunos WHERE id = 2')
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM alunos')
todos_alunos_pos_remocao = cursor.fetchall()

In [ ]:
print("Alunos após remoção:", todos_alunos_pos_remocao)

Alunos após remoção: [(1, 'Elisa', 32, 'Medicina'), (3, 'Brenda', 45, 'Medicina'), (4, 'Daniel', 21, 'Letras'), (5, 'Isa', 36, 'Música'), (6, 'Pedro', 20, 'Engenharia'), (7, 'Rick', 31, 'Engenharia')]

5. Criar uma Tabela e Inserir Dados

In [ ]:
cursor.execute('''
CREATE TABLE clientes (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    saldo REAL
)
''')

In [ ]:
clientes_dados = [
    (1, 'Carlos', 35, 1200.50),
    (2, 'Fernanda', 28, 800.00),
    (3, 'Marcos', 40, 1500.75),
    (4, 'Ana', 32, 950.00),
    (5, 'Lucas', 29, 450.25)
]

In [ ]:
cursor.executemany('INSERT INTO clientes VALUES (?, ?, ?, ?)', clientes_dados)
conn.commit()

6. Consultas e Funções Agregadas
Escreva consultas SQL para realizar as seguintes tarefas:

In [ ]:
#a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.
cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
clientes_maiores_30 = cursor.fetchall()

In [ ]:
print("Clientes com mais de 30 anos:", clientes_maiores_30)

Clientes com mais de 30 anos: [('Carlos', 35), ('Marcos', 40), ('Ana', 32)]

In [ ]:
#b) Calcule o saldo médio dos clientes.
cursor.execute('SELECT AVG(saldo) FROM clientes')
saldo_medio = cursor.fetchone()[0]

In [ ]:
print("Saldo médio dos clientes:", saldo_medio)

Saldo médio dos clientes: 980.3

In [ ]:
#c) Encontre o cliente com o saldo máximo
cursor.execute('SELECT nome, saldo FROM clientes ORDER BY saldo DESC LIMIT 1')
cliente_saldo_max = cursor.fetchone()

In [ ]:
print("Cliente com saldo máximo:", cliente_saldo_max)

Cliente com saldo máximo: ('Marcos', 1500.75)

In [ ]:
# d) Conte quantos clientes têm saldo acima de 1000
cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1000')
clientes_acima_1000 = cursor.fetchone()[0]

In [ ]:
print("Número de clientes com saldo acima de 1000:", clientes_acima_1000)

Número de clientes com saldo acima de 1000: 2

7. Atualização e Remoção com Condições

In [ ]:
# a) Atualize o saldo de um cliente específico
cursor.execute('UPDATE clientes SET saldo = 1600.00 WHERE nome = "Marcos"')
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM clientes WHERE nome = "Marcos"')
cliente_atualizado = cursor.fetchone()

In [ ]:
print("Cliente atualizado:", cliente_atualizado)

Cliente atualizado: (3, 'Marcos', 40, 1600.0)

In [ ]:
#b) Remova um cliente pelo seu ID.
cursor.execute('DELETE FROM clientes WHERE id = 5')
conn.commit()

In [ ]:
cursor.execute('SELECT * FROM clientes')
todos_clientes_pos_remocao = cursor.fetchall()

In [ ]:
print("Clientes após remoção:", todos_clientes_pos_remocao)

Clientes após remoção: [(1, 'Carlos', 35, 1200.5), (2, 'Fernanda', 28, 800.0), (3, 'Marcos', 40, 1600.0), (4, 'Ana', 32, 950.0)]

8. Junção de Tabelas
Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real). Insira algumas
compras associadas a clientes existentes na tabela "clientes".
Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [ ]:
cursor.execute('''
CREATE TABLE compras (
    id INTEGER PRIMARY KEY,
    cliente_id INTEGER,
    produto TEXT,
    valor REAL,
    FOREIGN KEY(cliente_id) REFERENCES clientes(id)
)
''')

In [ ]:
compras_dados = [
    (1, 1, 'Notebook', 2500.00),
    (2, 3, 'Smartphone', 1200.00),
    (3, 2, 'Tablet', 800.00)
]

In [ ]:
cursor.executemany('INSERT INTO compras VALUES (?, ?, ?, ?)', compras_dados)
conn.commit()

In [ ]:
cursor.execute('''
SELECT clientes.nome, compras.produto, compras.valor
FROM compras
JOIN clientes ON compras.cliente_id = clientes.id
''')

In [ ]:
compras_completo = cursor.fetchall()
print("Nome do cliente, produto e valor de cada compra:", compras_completo)

Nome do cliente, produto e valor de cada compra: [('Carlos', 'Notebook', 2500.0), ('Marcos', 'Smartphone', 1200.0), ('Fernanda', 'Tablet', 800.0)]